Revit 2026 API

# ParameterTypeIdRbsEnergyAnalysisExportGbxmlDefaultsParam Property

---

"Export Default Values"

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static ForgeTypeId RbsEnergyAnalysisExportGbxmlDefaultsParam { get; }
```
```vb
Public Shared ReadOnly Property RbsEnergyAnalysisExportGbxmlDefaultsParam As ForgeTypeId
	Get
```
```cpp
public:
static property ForgeTypeId^ RbsEnergyAnalysisExportGbxmlDefaultsParam {
	ForgeTypeId^ get ();
}
```
```fsharp
static member RbsEnergyAnalysisExportGbxmlDefaultsParam : ForgeTypeId with get
```

#### Property Value

ForgeTypeId

#### Reference

ParameterTypeId Class

Autodesk.Revit.DB Namespace